app/controllers/events_controller.rb

  def index
    @events = Event.all
    @month = (params[:month] || (Time.zone || Time).now.month).to_i
    @year = (params[:year] || (Time.zone || Time).now.year).to_i
    @event = Event.create(params[:event])
---
SELECT "events".* FROM "events" WHERE (user_id LIKE '%1%') AND (('2011-10-29 20:00:00.000000' <= end_at) AND (start_at< '2011-12-03 21:00:00.000000')) ORDER BY start_at ASC
INSERT INTO "events" ("created_at", "end_at", "name", "repeat", "repeat_after", "repeat_frequency", "start_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def new
    @event = Event.create
---
INSERT INTO "events" ("created_at", "end_at", "name", "repeat", "repeat_after", "repeat_frequency", "start_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @event = Event.find(params[:id])
    if @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 6]]

  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "39"]]
UPDATE "events" SET "name" = 'create', "start_at" = '2011-01-11 00:00:00.000000', "end_at" = '2011-02-11 00:00:00.000000', "updated_at" = '2011-11-18 16:05:54.734308' WHERE "events"."id" = 216